app/Models/Sipema/SubBidangModel.php

SELECT *
FROM `sipema_sub_bidang`
JOIN `sipema_bidang` ON `sipema_bidang`.`id_bidang` = `sipema_sub_bidang`.`id_bidang`
---
    function getSubBidangandBidang()
    {
        $builder = $this->db->table('sipema_sub_bidang');
        $builder->join('sipema_bidang', 'sipema_bidang.id_bidang = sipema_sub_bidang.id_bidang');
        $query = $builder->get();